#**Trabalhando com Planilhas do Excel**

In [1]:
#Importando a biblioteca
import pandas as pd

In [2]:
#Leitura dos arquivos
df1 = pd.read_excel("../datasets/Aracaju.xlsx")
df2 = pd.read_excel("../datasets/Fortaleza.xlsx")
df3 = pd.read_excel("../datasets/Natal.xlsx")
df4 = pd.read_excel("../datasets/Recife.xlsx")
df5 = pd.read_excel("../datasets/Salvador.xlsx")

In [3]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [4]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [9]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
72      Recife 2019-01-01   42.32     982     2
71    Salvador 2019-01-01   21.36    1035     2
98   Fortaleza 2019-01-01   15.00    1005     2
81       Natal 2019-04-02  564.00     854     2
102     Recife 2019-01-01   96.50     982     7

In [10]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [11]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [12]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [13]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [14]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [15]:
df["Vendas"].mean()

122.61180089485458

In [16]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [65]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
216   Salvador 2019-01-02    5.82   1035     1
224      Natal 2019-01-02  178.30   1035     3
34      Recife 2019-01-01   24.97    980     5
74      Recife 2019-01-01   38.79    983     6
193      Natal 2019-01-02    3.97   1036     2
136      Natal 2019-01-02   13.81   1036     1
113  Fortaleza 2019-03-02   38.63    980     2
64   Fortaleza 2019-01-01  110.31   1005     4
121    Aracaju 2018-01-01  162.07   1520     3
6      Aracaju 2018-01-01   35.50   1522     2
118      Natal 2019-01-02   92.21   1035     2
10      Recife 2019-01-01   38.51    982     8
41     Aracaju 2018-01-01  229.64   1520     8
130  Fortaleza 2019-03-02   12.36    983     4
130   Salvador 2019-03-02   59.78   1036     1

In [ ]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [ ]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [22]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [23]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [ ]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [74]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00    1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21    1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55    1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01    1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51    1522     8   196.08             8.0

In [121]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [76]:
#Retornando a menor receita
df["Receita"].min()

0.0

In [24]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [25]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [124]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     36122.23
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [125]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [17]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

<ipython-input-17-6b0551f32edb>:2: FutureWarning: casting datetime64[ns] values to int64 with .astype(...) is deprecated and will raise in a future version. Use .view(...) instead.
  df["Data"] = df["Data"].astype("int64")

In [18]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade     object
Data        int64
Vendas    float64
LojaID     object
Qtde        int64
dtype: object

In [19]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [20]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [28]:
#Agrupamento por ano
df.groupby([df["Data"].dt.year, df["Cidade"]])["Receita"].sum()

Data  Cidade
2018  Aracaju      46276.29
      Natal        71750.00
      Salvador       150.24
2019  Aracaju       2471.96
      Fortaleza    37913.97
      Natal        95477.52
      Recife       51936.51
      Salvador     40446.49
Name: Receita, dtype: float64

In [ ]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [133]:
df.sample(5)

       Cidade       Data  Vendas  ... Receita  Receita/Vendas  Ano_Venda
124  Salvador 2019-03-02   44.82  ...  134.46             3.0       2019
218  Salvador 2019-01-02  189.12  ...  567.36             3.0       2019
82    Aracaju 2018-01-01  150.48  ...  601.92             4.0       2018
29   Salvador 2019-01-01    9.27  ...    9.27             1.0       2019
123  Salvador 2019-03-02  127.45  ...  382.35             3.0       2019

[5 rows x 8 columns]

In [ ]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [136]:
df.sample(5)

      Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
97  Salvador 2019-01-01   39.91  ...      2019          1          1
12   Aracaju 2019-01-01    9.78  ...      2019          1          1
59     Natal 2018-01-15  369.00  ...      2018          1         15
13     Natal 2018-09-12  458.00  ...      2018          9         12
16   Aracaju 2018-01-01   37.68  ...      2018          1          1

[5 rows x 10 columns]

In [137]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [ ]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [139]:
df.sample(5)

       Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
104   Aracaju 2018-01-01   46.96  ...         1          1          0 days
70     Recife 2019-01-01   20.40  ...         1          1        365 days
50   Salvador 2019-01-01   44.87  ...         1          1        365 days
34     Recife 2019-01-01   24.97  ...         1          1        365 days
147  Salvador 2019-01-02   34.50  ...         1          2        366 days

[5 rows x 11 columns]

In [29]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [39]:
df.sample(5)

        Cidade       Data  Vendas LojaID  Qtde  Receita  trimestre_venda
27   Fortaleza 2019-01-01  212.37   1003     6  1274.22                1
0        Natal 2018-08-27  606.00    853     2  1212.00                3
91      Recife 2019-01-01  150.58    982     6   903.48                1
199   Salvador 2019-01-02  153.87   1036     3   461.61                1
117     Recife 2019-03-02   15.42    983     8   123.36                1

In [40]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [41]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas LojaID  Qtde  Receita  trimestre_venda
109  Fortaleza 2019-03-02   18.90    982     6   113.40                1
139  Fortaleza 2019-03-02  141.16    980     7   988.12                1
121  Fortaleza 2019-03-02   41.55    981     3   124.65                1
32       Natal 2019-03-17  244.00    854     2   488.00                1
5        Natal 2019-03-30  674.00    854     2  1348.00                1
122     Recife 2019-03-02  235.06    983     3   705.18                1
126   Salvador 2019-03-02   41.69   1036     2    83.38                1
133  Fortaleza 2019-03-02   14.67    980     7   102.69                1
133   Salvador 2019-03-02  153.71   1035     1   153.71                1
121   Salvador 2019-03-02  100.70   1037     3   302.10                1
133     Recife 2019-03-02   14.67    980     7   102.69                1
111   Salvador 2019-03-02  147.35   1037     2   294.70                1
131  Fortaleza 2019-03-02  139.07    982     6   834.42                1
110   Salvador 2019-03-02  185.93   1036     3   557.79                1
135  Fortaleza 2019-03-02   10.79    983     5    53.95                1
119  Fortaleza 2019-03-02  152.30    982     7  1066.10                1
50       Natal 2019-03-08  324.00    854     4  1296.00                1
136   Salvador 2019-03-02   13.81   1036     1    13.81                1
130     Recife 2019-03-02   12.36    983     4    49.44                1
111     Recife 2019-03-02    8.00    981     3    24.00                1